# Ultralytics YOLO 🚀, AGPL-3.0 license
# Modified YOLO11 model with bidirectional FPN neck and standard conv in P4 fusion

nc: 2
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
fusion_mode: concat
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10
head:
  # Top-down
  - [10 , 1, nn.Upsample, [None, 2, "nearest"]]   # 11II
  - [-1, 2, CSP_FreqSpatial, [512]]                  # 12
                
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [-1, 2, CSP_FreqSpatial, [256]]                 # 14

  # Bottom-up
  - [2, 1, Conv, [256, 3, 2]]                   # 15
  - [-1, 1, Conv, [512, 3, 2]]                  # 16
  - [-1, 1, Conv, [1024, 3, 2]]                 # 17
  # P3 fusion
  - [[14, 15, 4], 1, Fusion, [fusion_mode]] #18
  - [-1, 1, CBAM, []]  # 👈 添加 CBAM#19
  - [-1, 2, CSP_FreqSpatial, [256]] #20

  # P4 fusion
  - [[12, 16, 6], 1, Fusion, [fusion_mode]] #21
  - [-1, 1, CBAM, []]  # 👈 添加 CBAM#22
  - [-1, 2, CSP_FreqSpatial, [512]]   

  # P5 fusion
  - [[10, 17], 1, Fusion, [fusion_mode]] #24
  - [-1, 1, CBAM, []]  # 👈 添加 CBAM #25
  - [-1, 2, CSP_FreqSpatial, [1024]] 

  # Detect
  - [[20, 23, 26], 1, Detect, [nc]]             # Detect(P3, P4, P5)